/****************************************************************************
****************************************************************************/
#include <ioCC2540.h>

#define uchar unsigned char 
#define uint unsigned int

#define LED1 P1_0 // P1.0口控制LED1
#define KEY P0_3  //使用P0.3口控制外部按键
#define KEY1 P0_5 //恒定输出高

/****************************************************************************
* 名    称: DelayMS()
* 功    能: 以毫秒为单位延时，系统时钟不配置时默认为16M(用示波器测量相当精确)
* 入口参数: msec 延时参数，值越大，延时越久
* 出口参数: 无
****************************************************************************/
void DelayMS(uint len)
{ 
    while(len--)
        for (int i=0; i<535; i++);
}


/****************************************************************************
* 名    称: InitLed()
* 功    能: 设置LED灯相应的IO口
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void InitLed(void)
{
    P0DIR |= 0x20;   //P0.5定义为输出口
    P1DIR |= 0x01;   //P1.0定义为输出口
    LED1 = 0;        //LED1灯灭 
    KEY1 = 1;        //恒定输出高
}

/****************************************************************************
* 名    称: InitKey()
* 功    能: 设置KEY相应的IO口,采用中断方式 
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void InitKey()
{
    //P0SEL &= ~0x80;//P0.5设置为通用I/O口
    //P0DIR &= ~0x80;//P0.5设置为输入   
  
    P0SEL &= ~0x80;//P0.3设置为通用I/O口
    P0DIR &= ~0x80;//P0.3设置为输入    
    P0IEN |= 0x08;    // P0.3 设置为中断方式 1：中断使能
  //PICTL |= 0x02;    //下降沿触发   
    PICTL |= 0X00;    //P0端口下降沿触发
    IEN1 |= 0x20;    //允许P0口中断; 
    P0IFG = 0x00;    //初始化中断标志位  判断对应引脚发生的中断
    EA = 1;          //打开总中断
}


/****************************************************************************
* 名    称: P0_ISR(void) 中断处理函数 
* 描    述: # vepragmactor = 中断向量，紧接着是中断处理程序
****************************************************************************/
#pragma vector = P0INT_VECTOR    
__interrupt void P0_ISR(void) 
{ 
    DelayMS(10);     //延时去抖
    LED1 = ~LED1;    //改变LED1状态
    P0IFG = 0;       
    P0IF = 0;        //清端口中断标志 清中断状态标志位
} 

/****************************************************************************
* 程序入口函数
****************************************************************************/
void main(void)
{  
    InitLed();   //设置LED灯相应的IO口
    InitKey();  
    while(1)
    {
    }
}
